# Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

## Import Modules

In [1]:
import pandas as pd
import numpy as np

print("Pandas version:", pd.__version__)
print("NumPy version:", np.__version__)

Pandas version: 2.2.3
NumPy version: 2.1.3

## Persiapan Data Frame

In [14]:
n_row =10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_row, n_cols)), columns=cols)
df

    A   B   C   D   E
0  19  13   3  16  12
1  14  11   4  19  11
2  10   8   8   9  14
3  19  12  11   1  11
4  17   8  19  11   7
5   4  19   8  15   9
6   8  19  13  12   7
7  13  12  16   6   8
8   2   1  11   2  19
9  15   8   9  17  18

## Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [15]:
df.shape

(10, 5)

In [16]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi, random_state=1)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [17]:
df_1

    A   B   C   D   E
2  10   8   8   9  14
9  15   8   9  17  18
6   8  19  13  12   7
4  17   8  19  11   7
0  19  13   3  16  12
3  19  12  11   1  11
1  14  11   4  19  11

In [19]:
df_2

    A   B   C   D   E
5   4  19   8  15   9
7  13  12  16   6   8
8   2   1  11   2  19